tutorials/incompressible/simpleSolver/ras/pitzDailyExptInlet/0/U
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            timeVaryingMappedFixedValue;
        offset          (0 0 0);
        setAverage      off;
    }

    outlet
    {
        type            zeroGradient;
    }

    upperWall
    {
        type            noSlipWall;
    }

    lowerWall
    {
        type            noSlipWall;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
